# โมดูล หรือเรียกอีกอย่างว่าโปรแกรมย่อย เป็นการรวบรวมกลุ่มคําสั่งที่แยกย่อยออกมาจากตัวโปรแกรมหลัก
# มาเขียนเป้นอีกไฟล์หนึ่ง เพื่อให้การเขียนโปรแกรมของเราง่ายและเป็นระเบียบมากขึ้น
# เช่นโปรแกรมเกี่ยวกับ การพยากรณ์อากาศ ก็อาจจะแยกไฟล์ออกเป็น 2 ไฟล์
# คือไฟล์ที่ให้บริการข้อมูลสภาพอากาศ และ ไฟล์ที่ให้บริการคํานวณตัวเลข 
# ซึ่งการแยกกลุ่มคําสั่งออกมาเราจะเรีกว่าเป็น โมดูล (Module)
# โปรแกรมใดที่ต้องการเรียกใช้ 2 โมดูลนี้ ก็ต้องใช้คําสั่ง import เพื่อเรียกใช้งานได้เลย
 
'''

def addition(*args) :
    total = 0
    for i in range(len(args)):
        total += args[i]
    print("ผลบวก = ",total) 


addition(5,10,20)       

'''
#ไม่ต้องเขียนฟังก์ชั่นเองแบบข้างบนแล้วเพราะเราจะ import โมดูล (มาจากโปรแกรมย่อย ที่่มาจากไฟล์  calculate_service.py)

import calculate_service
import weather

calculate_service.addition(5,10,20)

x=calculate_service.PI
print("ค่า PI = ",x)

korat = weather.city["นครราชสีมา"]
print("สภาพอากาศของจังหวัดนครราชสีมา : ",korat)

all_province = weather.getWeather()
print("สภาพอากาศของทุกจังหวัดที่ได้เก็บข้อมูลไว้ : ",all_province)